<script lang="ts" setup>

import BlockTitle from "~/components/elements/BlockTitle/BlockTitle.vue";
import AccordionItem from "~/components/elements/AccordionItem/AccordionItem.vue";

const factors = ref([
  {
    title: 'Складність',
    description: 'Складності виконання робіт, товщини металу який буде зварюватись'
  }, {
    title: 'Характер робіт',
    description: 'характеру робіт, а саме який це вид робіт, наплавка відновлення різьби, заварка тріщини, вимоги до герметичності шву (так чи ні) і так далі'
  }
])

const items = ref([
  {
    "id": 1,
    "question": "Вартісь 1 метра зварного шву може коливатись від 2400 грн до 3300 грн",
    "answer": "Оплата за нашу роботу по виготовленню вироба/конструкції (зварювальні роботи)",
    "isOpen": false
  },
  {
    "id": 2,
    "question": "До цього ще додаємо вартість виїзду (транспортні витрати)",
    "answer": "Транспортні витрати/найманий водій.",
    "isOpen": false
  },
  {
    "id": 3,
    "question": "Вартість матеріалів (наприклад труби із яких виготовляється виріб) та вартість розхідматеріалів теж окремо (алюмінієвий зварювальний дріт, аргон, інші витратні матеріали)",
    "answer": "Алюмінієвий прокат наприклад труби із яких виготовляється виріб (якщо це не ремонтні роботи). А також алюмінієвий зварювальний дріт, аргон, інші витратні матеріали.",
    "isOpen": false
  },
  {
    "id": 4,
    "question": "Вартість проектування, якщо це складний виріб",
    "answer": "Якщо мова йде про виготовлення якогось виробу чи конструкції із алюмінію, скоріш за все його потрібно буде попередньо спроектувати у спеціальній програмі із можливістю 3Д візуалізації, щоб клієнт розумів що він отримає за свої кошти. Вартість проектування - орієнтовно 375 грн/год.",
    "isOpen": false
  },
  {
    "id": 5,
    "question": "Вартість монтажу, якщо виріб монтується у Вас по місцю його експлуатації (наприклад навіс, ворота, тощо)",
    "answer": "Якщо виріб монтується у Вас по місцю його експлуатації",
    "isOpen": false
  },
  {
    "id": 6,
    "question": "Вартість орендної плати та витраченої електроенергії, якщо виріб/конструкція виготовляється у нас в цеху",
    "answer": "Якщо перед монтажем виріб/конструкція виготовляється у нас в цеху (сюди ж входять амортизаційні та інші витрати (канцелярські тощо)",
    "isOpen": false
  },
])

const toggleAnswer = id => {
  items.value = items.value.map(item => item.id === id ? {...item, isOpen: !item.isOpen} : item)
}
</script>

<template>
  <div id="our-prices" class="our-prices wrapper">
    <block-title title="Ціни на послуги"/>
    <p class="text">Ціни визначаються здебільшого індивідуально, в залежності від декількох факторів, а саме:</p>
    <ul class="factors-list">
      <li v-for="(factor, index) in factors" :key="index" class="factor-item">
        <block-title :title="factor.title" is-subtitle/>
        <p class="factor-item__description">{{ factor.description }}</p>
      </li>
    </ul>
    <p class="marked-text">До прикладу якщо виготовляється виріб або конструкція з алюмінію ціна може формуватись
      орієнтовно так:</p>
    <div class="accordion-item-wrapper">
      <accordion-item
          v-for="item in items"
          :key="item.id"
          :item="item"
          @toggle-answer="toggleAnswer"
      />
    </div>
    <p class="accent-text">І в результаті ви отримуєте виріб, який
      <mark>не обов’язково фарбувати</mark>
      , так як він практично не
      страждає від корозії та
      <mark>є значно легшим</mark>
      від свого сталевого аналогу. Має сріблястий колір (свій природній)
    </p>
    <div class="factor-item">
      <block-title is-subtitle title="Примітка"/>
      <p class="factor-item__description">Також якщо це зварювально ремонтні роботи слід памятати, що алюміній - дуже
        "капризний" метал, коли мова йде про його зварювання і в цьому плані "любить абсолютну чистоту". І дуже часто
        буває так що деталі (наприклад автодеталі - ГБЦ, піддон) та багато інших подібних деталей приносять в
        забрудненому виді, їх потрібно додатково відмивати та обезжирювати, однозначно це теж впливає на ціну, так як це
        додатково витрачений час та ресурси</p>
    </div>
  </div>
</template>

<style lang="scss" scoped>
@use "our-prices";
</style>
